"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]},
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""

sales = [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]},
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
]

all_sum = 0
all_len = 0
for phone in sales:
    sum_score = sum(phone['items_sold'])
    print(f"Суммарное количество продаж {phone['product']}: {sum_score}")

    avg_sum = sum_score // len(phone['items_sold'])
    print(f"Среднее количество продаж {phone['product']}: {avg_sum}")

    all_len += len(phone['items_sold'])
    all_sum += sum_score

    avg_all_sum = all_sum // all_len
print(f"Среднее количество продаж всех товаров: {avg_all_sum}")
print(f"Суммарное количество продаж всех товаров: {all_sum}")
