"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""

def main(sales_figures):
    total_sales = average_sales = 0
    for i in sales_figures:
        phone = i['product']
        t_sale = a_sale = 0
        for sale in i['items_sold']:
            t_sale += sale
            a_sale += 1
            total_sales += sale
            average_sales += 1
        print(f'суммарное количество продаж {phone}: {total_sales}, среднее количество продаж {phone}: {total_sales // average_sales}')
    print(f'суммарное количество продаж всех товаров: {total_sales}, среднее количество продаж всех товаров: {total_sales // average_sales}')

sales_figures =  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]


if __name__ == "__main__":
    main(sales_figures)