"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по количеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]},
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара *
* Посчитать и вывести среднее количество продаж для каждого товара *
* Посчитать и вывести суммарное количество продаж всех товаров *
* Посчитать и вывести среднее количество продаж всех товаров *
"""

def main(args):
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
    sum_, average = [], []
    len_all = 0
    for i in args:
        sum_.append(sum(i['items_sold']))
        average.append(sum(i['items_sold']) / len(i['items_sold']))
        len_all += len(i['items_sold'])

    print(*sum_)
    print(*average)
    print(sum(sum_))
    print(sum(sum_) / len_all)


my_dict = [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]},
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]

if __name__ == "__main__":
    main(my_dict)
