'''
Создать список из десяти целых чисел.
Вывести на экран каждое число, увеличенное на 1.
'''
students_scores = [1, 21, 19, 6, 5, 4, 6, 3, 7, 1]

for scores in students_scores:
    print(scores +1)
    



'''
Ввести с клавиатуры строку.
Вывести эту же строку вертикально: по одному символу на строку консоли.
'''

greeting = 'Hi! How are you?'

for word in greeting:
    print(word)
